# St7GetNumTableTypeRows

Returns the number of rows in the specified table.

long St7GetNumTableTypeRows(long uID, long TableType, long TableID,
long* NumRows)
Input Parameters
uID
Strand7 model file ID.
TableType
One of the table types listed in Table Types.
TableID
Table ID.
Output Parameters
NumRows
Number of rows.